### Pandas - DataFrame
#### 데이터프레임 생성

In [1]:
import pandas as pd
import numpy as np

In [90]:
data = {'국어' : [80,90,70,30], '영어' : [90,70,60,40], '수학': [90,60,80,70]}
df=pd.DataFrame(data)
df

   국어  영어  수학
0  80  90  90
1  90  70  60
2  70  60  80
3  30  40  70

In [91]:
df.index= ['춘향', '몽룡', '향단', '방자']
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [9]:
np.random.seed(2022)
df2 = pd.DataFrame(np.random.randint(40,101,12).reshape(4,3), columns=['국어','영어','수학'], index= ['춘향', '몽룡', '향단', '방자'])
df2

    국어  영어  수학
춘향  68  85  88
몽룡  89  89  88
향단  95  64  58
방자  64  56  93

In [10]:
# 반복문을 써서 만드는 경우
kor, eng, mat = [],[],[]
for i in range(4):
    kor.append(np.random.randint(40,101))
    eng.append(np.random.randint(40,101))
    mat.append(np.random.randint(40,101))

In [12]:
pd.DataFrame({'국어':kor, '영어':eng , '수학':mat}, index=['나', '너', '너2', '너3'])

    국어  영어  수학
나   81  73  67
너   51  59  70
너2  80  51  88
너3  59  78  48

In [86]:
line=[]
for i in range(4):
    d = {'국어':np.random.randint(40,101),'영어':np.random.randint(40,101) ,'수학':np.random.randint(40,101)}
    line.append(d)
pd.DataFrame(line)

   국어  영어  수학
0  40  85  69
1  63  77  61
2  96  51  83
3  86  42  92

#### 2. 데이터프레임 인덱싱

In [16]:
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [19]:
# 인덱싱 순서 - 열 인덱스, 행 인덱스 순
# 시리즈(국어, 영어, 수학)를 먼저 선택하고, 인덱스를 선택한다.
df['국어']['방자']

30

In [20]:
df['국어']

춘향    80
몽룡    90
향단    70
방자    30
Name: 국어, dtype: int64

In [21]:
df.국어

춘향    80
몽룡    90
향단    70
방자    30
Name: 국어, dtype: int64

In [25]:
df.영어.몽룡, df.영어[1]

(70, 70)

In [26]:
#슬라이스
df['국어'][:2]

춘향    80
몽룡    90
Name: 국어, dtype: int64

In [28]:
# 슬라이싱을 할 때 인덱스 값으로 문자열을 주면 숫자와는 다르게 포함한다.
df.국어[:'몽룡']

춘향    80
몽룡    90
Name: 국어, dtype: int64

In [30]:
df[['국어', '영어']]

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40

In [33]:
df['국어']#인덱스 값 하나만 넣으면 numpy array로 반환한다.

춘향    80
몽룡    90
향단    70
방자    30
Name: 국어, dtype: int64

In [34]:
 df[['국어']]#리스트로 넣으면 데이터프레임으로 반환한다.

    국어
춘향  80
몽룡  90
향단  70
방자  30

- 결과를 데이터프레임으로 (Selection)

- loc 인덱서 : [행, 열]

In [37]:
df.loc['몽룡','국어'], df.loc['몽룡']['영어'], df.loc['몽룡'][1]

(90, 70, 70)

- iloc 인덱서 : [행 숫자 인덱스, 열 숫자 인덱스]

In [41]:
df.iloc[1,1], df.iloc[1][1]

(70, 70)

In [42]:
df.iloc[:2, 1:]

    영어  수학
춘향  90  90
몽룡  70  60

In [63]:
df['수학']['방자'], df['수학'].방자, df['수학'][-1], df.loc['방자']['수학'], df.loc['방자', '수학'], df.loc['방자'][2], df.loc['방자'].수학, df.iloc[-1][-1], df.iloc[-1, -1], df.iloc[-1][2]

(70, 70, 70, 70, 70, 70, 70, 70, 70, 70)

- 값 변경

In [67]:
df['국어'].방자 = 90
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  90  40  70

In [68]:
df.영어.방자=85
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  90  85  70

In [92]:
#열추가
df['과학']=[40.3,80,75.3,68.5]
df

    국어  영어  수학    과학
춘향  80  90  90  40.3
몽룡  90  70  60  80.0
향단  70  60  80  75.3
방자  30  40  70  68.5

In [72]:
#df['한국사']=[40.3,80,75.3] 인덱스 개수가 맞지않음
#df.한국사 = [1,2,3,4] .은 인덱스만 가능하다 값 추가는 불가능

In [76]:
df['평균']=df.mean(axis=1)
df

    국어  영어  수학    과학      평균
춘향  80  90  90  40.3  75.075
몽룡  90  70  60  80.0  75.000
향단  70  60  80  75.3  71.325
방자  90  85  70  68.5  78.375

- 열 삭제

In [78]:
del df['평균']
df

    국어  영어  수학    과학
춘향  80  90  90  40.3
몽룡  90  70  60  80.0
향단  70  60  80  75.3
방자  90  85  70  68.5

In [79]:
df.drop(columns=['수학', '과학'], inplace=True)
df

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  90  85

In [93]:
df.drop(index=['방자'])
df.drop(['방자'], inplace=True)

In [94]:
df

    국어  영어  수학    과학
춘향  80  90  90  40.3
몽룡  90  70  60  80.0
향단  70  60  80  75.3